# 01 Import libraries

In [2]:
# import libraries
import pandas as pd
import numpy as np
import os

# 02 Import data

In [3]:
# path to C drive under instacart, 02 Data folder
path = r'C:\Users\erhil\OneDrive\Career Foundry Program\Immersion Data Analytics Course\A4 - Python Fundamentals for Data Analysts\02-2022 Instacart Basket Analysis\02 Data'

In [4]:
df_prods = pd.read_csv(os.path.join(path, 'Original Data', 'products.csv'), index_col = False)

In [5]:
df_ords = pd.read_csv(os.path.join(path, 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# 03 Report to understand df

In [6]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,user_order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

# **Test dataframe - exercise(not part of Instacart)

In [7]:
# Create a dataframe
df_test = pd.DataFrame()

In [8]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [9]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [10]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mix     4 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

In [11]:
#Check for mixed types
for col in df_test.columns.tolist():
    weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[weird]) > 0:
        print (col)

mix

In [12]:
df_test['mix']=df_test['mix'].astype('str')

# 04 Exploring & cleaning products df (null values)

In [13]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [14]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [15]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [16]:
#check out rows/column counts
df_prods.shape

(49693, 5)

In [17]:
# create a new products df without null product names
df_prods_clean = df_prods[df_prods['product_name'].isnull()==False]

In [18]:
df_prods_clean.shape

(49677, 5)

In [19]:
#create a new df with only the duplicated values in the products df
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [20]:
#see df of only duplicates
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [21]:
#create a new df with no duplicates from the clean products df
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [23]:
#check to see how many records effected
df_prods_clean_no_dups.shape

(49672, 5)

In [24]:
df_prods_clean_no_dups.to_csv(os.path.join(path,'Prepared Data', 'products_checked.csv'))

# Task 4.5

In [28]:
#Q1 Check for mixed data-type products
for col in df_prods_clean_no_dups.columns.tolist():
    weird = (df_prods_clean_no_dups[[col]].applymap(type) != df_prods_clean_no_dups[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_prods_clean_no_dups[weird]) > 0:
        print (col)
# did not locate any mixed data-types in df_prods_clean_no_dups

In [31]:
#Q1 
df_prods_clean_no_dups.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [32]:
#command for Q2, answer below
df_prods_clean_no_dups.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [33]:
# Q2 - The prices max out at 99,999. Which is absurd unless dealing with higher priced merch such as cars, etc.
# Aisle id is odd since the min is 1 and max is 134, if there were exactly 134 aisles, the 50% should be 67.5, the 25% should be 34, and the 75% should be 101. And the mean and median should match if the aisles were evenly distributed. There must be missing/duplicated aisles?
# Also with aisle id, the mean and median show that the data is right-skewed.

In [34]:
# Q3 check for mixed-type data in orders
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ords[weird]) > 0:
        print (col)
# Q4 did not locate any mixed-type data in orders dataframe

In [35]:
# Q5 check for missing values in orders df
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
user_order_number              0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [36]:
df_ords.shape

(3421083, 7)

In [37]:
df_nan_ords = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [38]:
df_nan_ords

,Unnamed: 0,order_id,user_id,user_order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [39]:
df_nan_ords['user_order_number'].value_counts(dropna=False)

1    206209
Name: user_order_number, dtype: int64

In [40]:
#Q5 The 206209 values that are missing from the days_since_prior_order column are all of the records where the user_order number were 1.
# So, the record would not have had a previous order to compare it to and will not have a "days_since_prior_order" value.

In [41]:
#Q6 I created another dataframe below to only include the non-null "days_since_prior_order" values
# I chose to do this so that the initial orders were not lost in the original orders df, but could reference the returning customers in this one
df_ords_returning_users = df_ords[df_ords['days_since_prior_order'].isnull()==False]

In [42]:
df_ords_returning_users.shape

(3214874, 7)

In [43]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [44]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, user_order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [45]:
#Q7 There were no duplicates in the df_ords file

In [46]:
# Q9
# save orders_return_users from df_ords_returning_users in this script
# save products from df_prods in this script

df_ords_returning_users.to_csv(os.path.join(path,'Prepared Data', 'orders_return_users.csv'))
df_prods_clean_no_dups.to_csv(os.path.join(path, 'Prepared Data', 'products_checked.csv'))

In [47]:
# I chose to use the df_prods_clean_no_dups for the remainder of the section, as I have already performed the other consistency checks on that same data.